<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"57e9d8ef1f5556393bdd132eb3323c9f18ad58920d6aebd874eb88a6426cab07","plan_job_ref":"Job Write Terraform Plan to Pull Request #43 at https://github.com/hackforla/devops-security/actions/runs/9098907125","plan_out_hash":"2a76221056ba71fa3e8ab7142973040b5102fb80036f71b3dedd52c6c25f41aa","plan_hash":"25a59750e33547b6577aa877a23fc13801002f792ad6daa8c3d68bf669e11b3d","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 2 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.iam_oidc_gha_incubator.aws_iam_role.github_actions_oidc is tainted, so must be replaced
-/+ resource "aws_iam_role" "github_actions_oidc" {
!~      arn                   = "arn:aws:iam::035866691871:role/gha-incubator" -> (known after apply)
!~      create_date           = "2024-05-16T02:01:39Z" -> (known after apply)
!~      id                    = "*************" -> (known after apply)
        name                  = "gha-incubator"
+       name_prefix           = (known after apply)
-       tags                  = {} -> null
!~      tags_all              = {} -> (known after apply)
!~      unique_id             = "*********************" -> (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.iam_user_tylerthome.aws_iam_user_login_profile.user_login will be created
+   resource "aws_iam_user_login_profile" "user_login" {
+       encrypted_password      = (known after apply)
+       id                      = (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (known after apply)
+       password_length         = 20
+       password_reset_required = true
+       user                    = "tyler.thome"
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Write Terraform Plan to Pull Request #43](https://github.com/hackforla/devops-security/actions/runs/9098907125)